CSI API ETABS v1
cSapModel.GetProgramInfo Method
 Retrieve information about the program
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetProgramInfo(
	ref string ProgramName,
	ref string ProgramVersion,
	ref string ProgramLevel
)
Function GetProgramInfo (
	ByRef ProgramName As String,
	ByRef ProgramVersion As String,
	ByRef ProgramLevel As String
) As Integer
Dim instance As cSapModel
Dim ProgramName As String
Dim ProgramVersion As String
Dim ProgramLevel As String
Dim returnValue As Integer
returnValue = instance.GetProgramInfo(ProgramName,
	ProgramVersion, ProgramLevel)
int GetProgramInfo(
	String^% ProgramName,
	String^% ProgramVersion,
	String^% ProgramLevel
)
abstract GetProgramInfo :
        ProgramName : string byref *
        ProgramVersion : string byref *
        ProgramLevel : string byref -> int
Parameters
ProgramName
Type: System.String
 The program name
ProgramVersion
Type: System.String
 The program version
ProgramLevel
Type: System.String
 The program level
Return Value
Type: Int32
 Returns zero if the data is successfully retrieved; otherwise it returns a nonzero value.
See Also
Reference
cSapModel Interface
ETABSv1 Namespace